#include<stdio.h>

int findSkill(int id);

typedef struct {
	int id;
	char name[64];
	int cost;
}Skill;

//スキル番号, 名前, コスト
Skill skills[] = {
	//3コスト
	{1, "火属性攻撃強化", 3},
	{2, "水属性攻撃強化", 3},
	{3, "雷属性攻撃強化", 3},
	{4, "氷属性攻撃強化", 3},
	{5, "龍属性攻撃強化", 3},
	{6, "毒耐性", 3},
	{7, "麻痺耐性", 3},
	{8, "睡眠耐性", 3},
	{9, "爆破やられ耐性", 3},
	{10, "気絶耐性", 3},
	{11, "風圧耐性", 3},
	{12, "腹減り耐性", 3},
	{13, "アイテム使用強化", 3},
	{14, "回復速度", 3},
	{15, "滑走強化", 3},
	{16, "供応", 3},
	{17, "広域化", 3},
	{18, "スタミナ奪取", 3},
	{19, "精霊の加護", 3},
	{20, "属性やられ耐性", 3},
	{21, "体力回復量UP", 3},
	{22, "泥雪体制", 3},
	{23, "砥石使用高速化", 3},
	{24, "飛び込み", 3},
	{25, "乗り名人", 3},
	{26, "ひるみ軽減", 3},
	{27, "笛吹き名人", 3},
	{28, "不屈", 3},
	{29, "壁面移動【翔】", 3},
	{30, "防御", 3},
	{31, "満足感", 3},
	{32, "陽動", 3},
	
	//6コスト
	{33, "状態異常攻撃強化", 6},
	{34, "霞皮の恩恵", 6},
	{35, "炎鱗の恩恵", 6},
	{36, "鋼殻の恩恵", 6},
	{37, "泡沫の舞", 6},
	{38, "ガード強化", 6},
	{39, "ガード性能", 6},
	{40, "回避距離UP", 6},
	{41, "回避性能", 6},
	{42, "逆襲", 6},
	{43, "KO術", 6},
	{44, "顕如盤石", 6},
	{45, "剛心", 6},
	{46, "スタミナ急速回復", 6},
	{47, "煽衛", 6},
	{48, "装填速度", 6},
	{49, "体術", 6},
	{50, "耐震", 6},
	{51, "特殊射撃強化", 6},
	{52, "破壊王", 6},
	{53, "納刀術", 6},
	{54, "抜刀術【力】", 6},
	{55, "早食い", 6},
	{56, "反動軽減", 6},
	{57, "ブレ抑制", 6},
	{58, "壁面移動", 6},
	{59, "砲弾装填", 6},
	{60, "ランナー", 6},

	//9コスト
	{61, "合気", 9},
	{62, "鬼火纏", 9},
	{63, "会心撃【属性】", 9},
	{64, "翔虫使い", 9},
	{65, "火事場力", 9},
	{66, "風纏", 9},
	{67, "キノコ大好き", 9},
	{68, "強化持続", 9},
	{69, "激昂", 9},
	{70, "研磨術【鋭】", 9},
	{71, "業鎧【修羅】", 9},
	{72, "巧撃", 9},
	{73, "剛刃研磨", 9},
	{74, "攻勢", 9},
	{75, "弱点特効【属性】", 9},
	{76, "集中", 9},
	{77, "状態異常確定蓄積", 9},
	{78, "心眼", 9},
	{79, "刃鱗磨き", 9},
	{80, "攻めの守勢", 9},
	{81, "弾導鏡花", 9},
	{82, "チャージマスター", 9},
	{83, "抜刀術【技】", 9},
	{84, "粉塵纏", 9},
	{85, "奮闘", 9},
	{86, "耳栓", 9},
	{87, "龍気活性", 9},
	{88, "狂竜症【翔】", 9},

	//12コスト
	{89, "狂竜症【蝕】", 12},
	{90, "血氣", 12},
	{91, "幸運", 12},
	{92, "高速変形", 12},
	{93, "渾身", 12},
	{94, "災禍転福", 12},
	{95, "逆恨み", 12},
	{96, "死中に活", 12},
	{97, "匠", 12},
	{98, "力の解放", 12},
	{99, "蓄積時攻撃強化", 12},
	{100, "チューンアップ", 12},
	{101, "挑戦者", 12},
	{102, "フルチャージ", 12},
	{103, "砲術", 12},
	{104, "闇討ち", 12},
	{105, "連撃", 12},
	{106, "龍気変換", 12},
	{107, "冰気錬成", 12},
	
	//15コスト
	{108,"貫通弾・貫通矢強化", 15},
	{109,"攻撃", 15},
	{110,"根性", 15},
	{111,"散弾・拡散矢強化", 15},
	{112,"弱点特効", 15},
	{113,"装填拡張", 15},
	{114,"速射強化", 15},
	{115,"達人芸", 15},
	{116,"弾丸節約", 15},
	{117,"超会心", 15},
	{118,"通常弾・連射矢強化", 15},
	{119,"見切り", 15},
	{120,"業物", 15},
};
#define SKILL_COUNT (sizeof(skills) / sizeof(skills[0]))


//スキル番号から配列位置を検索
int findSkill(int id) {
		int i;

		for (i = 0; i < 120; i++) {
			if (skills[i].id == id) {
				return i;
			}
		}
		return -1;
}

int main(void) {
	int baseCost,index, slotAdd, remainingCost, lostLevel = 0;
	int i;
	int skillId[3] = {0}, skillLevel[3] = {0};

	//プログラム開始時に一度だけ表示
	printf("===== スキル番号一覧 =====\n");
	for (i = 0; i < 120; i++) {
		printf("%3d : %-30s コスト %d\n", skills[i].id, skills[i].name, skills[i].cost);
	}

	printf("防具の基礎コスト: ");
	if (scanf("%d", &baseCost) != 1 || baseCost < 0) {
		printf("入力エラー\n");
		return 1;
	}
	
	remainingCost = baseCost;

	printf("消失するスキルのレベル数: ");
	if (scanf("%d", &lostLevel) != 1 || lostLevel < 0)
		return 1;
	

	remainingCost += 10 * lostLevel;

	for (i = 0; i < 3; i++) {
		printf("追加スキル%dの番号(例:119 = 見切り)(0:なし): ", i + 1);
		if (scanf("%d", &skillId[i]) != 1) {
			printf("入力エラー\n");
			return 1;
		}

		if (skillId[i] == 0) {
			skillLevel[i] = 0;
			continue;
		}

		index = findSkill(skillId[i]);

		if (index < 0) {
			printf("存在しないスキル番号です\n");
			return 1;
		}

		printf("追加スキル%dのレベル: ", i + 1);

		if (scanf("%d", &skillLevel[i]) != 1 || skillLevel[i] < 1) {
			printf("入力エラー\n");
			return 1;
		}
		printf("確認: 番号 = %d, コスト = %d, Lv = %d\n", skillId[i], skills[index].cost, skillLevel[i]);
		remainingCost -= skills[index].cost * skillLevel[i];
	
		printf("\n%s +%d: コスト %d\n\n", skills[index].name, skillLevel[i], skills[index].cost);
	}

	printf("スロット追加数(0～5): ");

	if (scanf("%d", &slotAdd) != 1 || slotAdd < 0 || slotAdd > 6) {
		printf("入力エラー\n");
		return 1;
	}

	remainingCost -= slotAdd * 6;

	printf("\n=== 計算結果 ===\n");
	printf("余剰コスト: %d\n", remainingCost);
	
	if (0 > remainingCost && remainingCost  > -21)
		printf("存在する可能性がある\n");
	if (remainingCost > 0)
		printf("存在する可能性が非常に高い\n");

	
	return 0;
}